// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

Bool flagwin = false;
{
    Console.WriteLine("Введите число");
    int a = Convert.ToInt32(Console.ReadLine());

    int a/2;

    if a/2 == int number;
    flagwin = true;
    Console.Write("Да");

    flagwin = false;
    Console.Write("Нет");
    }